Tekla Open API Reference for Tekla Structures 2025
AnalysisModelIssue.ModelObjects Property
 Gets or sets the model objects of the issue
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<ModelObject> ModelObjects { get; set; }
Public Property ModelObjects As List(Of ModelObject)
	Get
	Set
Property Value
Type: List<ModelObject>
See Also
Reference
AnalysisModelIssue Class
Tekla.Structures.Analysis Namespace